Revit 2024 API
StairsRun.GetStairsPath Method
 Returns the stairs path curves on the run. The curves are projected on base level of the stairs.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public CurveLoop GetStairsPath()
Visual Basic
Public Function GetStairsPath As CurveLoop
Visual C++
public:
CurveLoop^ GetStairsPath()
Return Value
 The stairs path curves.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  The stairs run has no stairs path it probably because the run was not generated yet.
See Also
StairsRun Class
Autodesk.Revit.DB.Architecture Namespace